#+TITLE: Does the leaf economic spectrum hold within plant functional types? A Bayesian multivariate trait meta-analysis
#+AUTHOR:
#+DATE:

#+OPTIONS: toc:nil tags:nil
#+CSL_STYLE: ecology-letters.csl

#+LATEX_HEADER: \usepackage[left=1in,right=1in,top=1in,bottom=1in]{geometry}
#+LATEX_HEADER: \usepackage{lineno}

#+LATEX_HEADER: \usepackage[noblocks]{authblk}

#+LATEX_HEADER: \usepackage{setspace}

#+LATEX_HEADER: \usepackage{booktabs}

#+LATEX_HEADER: \author[1,*]{Alexey N. Shiklomanov <alexey.shiklomanov@pnnl.gov>}
#+LATEX_HEADER: \affil[1]{Joint Global Change Research Institute, Pacific Northwest National Laboratory, College Park, MD}
#+LATEX_HEADER: \author[2]{Elizabeth M. Cowdery <ecowdery@bu.edu>}
#+LATEX_HEADER: \affil[2]{Department of Earth \& Environment, Boston University, Boston, MA}
#+LATEX_HEADER: \author[3]{Michael Bahn <Michael.Bahn@uibk.ac.at>}
#+LATEX_HEADER: \affil[3]{Institute of Ecology, University of Innsbruck, 6020 Innsbruck, Austria}
#+LATEX_HEADER: \author[4]{Chaeho Byun <chaeho.byun@mail.mcgill.ca>}
#+LATEX_HEADER: \affil[4]{School of Civil and Environmental Engineering, Yonsei University, Seoul 03722, Korea}
#+LATEX_HEADER: \author[5]{Steven Jansen <steven.jansen@uni-ulm.de>}
#+LATEX_HEADER: \affil[5]{Institute of Systematic Botany and Ecology, Ulm University, Ulm, Germany}
#+LATEX_HEADER: \author[6]{Koen Kramer <koen.kramer@wur.nl>}
#+LATEX_HEADER: \affil[6]{Vegetation, Forest, and Landscape Ecology, Wageningen Environmental Research and Wageningen University, Wageningen, Gelderland, The Netherlands}
#+LATEX_HEADER: \author[7,8]{Vanessa Minden <vanessa.minden@uni-oldenburg.de>}
#+LATEX_HEADER: \affil[7]{Institute for Biology and Environmental Sciences, Carl von Ossietzky-University of Oldenburg, Carl von Ossietzky Str. 9-11, 26129 Oldenburg, Germany}
#+LATEX_HEADER: \affil[8]{Department of Biology, Ecology and Evolution, Vrije Universiteit Brussel, Pleinlaan 2, 1050 Brussels}
#+LATEX_HEADER: \author[9]{\"Ulo Niinemets <ylo.niinemets@emu.ee>}
#+LATEX_HEADER: \affil[9]{Institute of Agricultural and Environmental Sciences, Estonian University of Life Sciences, Kreutzwaldi 1, 51014 Tartu, Estonia}
#+LATEX_HEADER: \author[10]{Yusuke Onoda <yusuke.onoda@gmail.com>}
#+LATEX_HEADER: \affil[10]{Graduate School of Agriculture, Kyoto University, Kyoto, 605-8503, Japan}
#+LATEX_HEADER: \author[11]{Nadejda A. Soudzilovskaia <n.a.soudzilovskaia@cml.leidenuniv.nl>}
#+LATEX_HEADER: \affil[11]{Conservation Biology Department, Institute of Environmental Sciences, Leiden University, Leiden, The Netherlands}
#+LATEX_HEADER: \author[2]{Michael C. Dietze <dietze@bu.edu>}

#+LATEX_HEADER: \affil[*]{Corresponding author; Phone: (301) 314-6713; Fax: (301) 314-6719; Email: alexey.shiklomanov@pnnl.gov; Mail: 5825 University Research Ct., Office 3533, College Park, MD 20740}

#+LATEX_HEADER: \renewcommand\Authfont{\footnotesize}
#+LATEX_HEADER: \renewcommand\Affilfont{\scriptsize}

#+BEGIN_EXPORT latex
\begin{footnotesize}
\noindent
\textbf{Article type:} Methods

\noindent
\textbf{Author contributions:}
ANS wrote the manuscript and implemented the analysis.
ANS and EMC designed the analysis and figures.
MCD conceived the original idea for the manuscript, guided its development, and provided financial support.
MB, SJ, KK, ÜN, and NAS provided extensive feedback on multiple drafts of the manuscript, and contributed data.
CB and YO contributed data.

\noindent
\textbf{Data accessibility:}
The R code and ancillary data for running these analyses is publicly available online via the Open Science Framework at https://osf.io/w8y73/.
The TRY data request used for this analysis has been archived at http://try-db.org,
and can be retrieved by providing the TRY data request ID (\#1584).
Alternatively, the exact pre-formatted data used in this analysis are available on request to Alexey Shiklomanov (alexey.shiklomanov@pnnl.gov).

\noindent
\textbf{Running title:} Leaf economic spectrum within vs. across PFTs (45 characters)

\noindent
\textbf{Keywords:} Functional trade-off; hierarchical modeling; trait variation; ecological modeling; leaf morphology; leaf biochemistry

\end{footnotesize}
#+END_EXPORT

#+ATTR_LATEX: :font \footnotesize
| Section               | Word count |   |            |     |
|-----------------------+------------+---+------------+-----|
| Abstract              |        146 |   | Figures    |   5 |
| Introduction          |        873 |   | Tables     |   1 |
| Materials and methods |       1543 |   | References | 100 |
| Results               |        821 |   |            |     |
| Discussion            |       1599 |   |            |     |
|-----------------------+------------+---+------------+-----|
| Total                 |       4982 |   |            |     |
#+TBLFM: @7$2=vsum(@I..II)

#+BEGIN_EXPORT latex
\linenumbers
\doublespacing
#+END_EXPORT

* Tables                                                           :no_title:

#+BEGIN_EXPORT latex
\pagebreak
#+END_EXPORT

#+NAME: pfts
#+BEGIN_SRC R :exports results :results output latex
library(shiklomanov2017np)
traits_file <- "~/laptop_folders/Projects/new-phytologist-traits/np-trait-analysis/extdata/traits_analysis.rds"
try_data <- readRDS(traits_file)
n_species <- try_data %>%
  distinct(clm45, AccSpeciesID) %>%
  select(pft = clm45, species = AccSpeciesID) %>%
  count(pft) %>%
  mutate(
    pft = as.character(pft),
    label = pft2abbr[pft],
    pft = tools::toTitleCase(gsub("_", " ", pft))
  ) %>%
  select(`Label` = label, `PFT` = pft, `Number of species` = n)
species_caption <- paste(
  "\\label{tab:pfts}Names, labels, and species counts for plant functional types (PFTs)",
  "used in this analysis."
)
kable(
  n_species,
  caption = species_caption,
  align = rep("c", ncol(n_species)),
  format = "latex",
  booktabs = TRUE
) %>%
  kableExtra::kable_styling(latex_options = "hold_position")
#+END_SRC

#+RESULTS: pfts
#+BEGIN_EXPORT latex
\begin{table}[!h]

\caption{\label{tab:}\label{tab:pfts}Names, labels, and species counts for plant functional types (PFTs) used in this analysis.}
\centering
\begin{tabular}[t]{ccc}
\toprule
Label & PFT & Number of species\\
\midrule
BlETr & Broadleaf Evergreen Tropical & 1229\\
BlETe & Broadleaf Evergreen Temperate & 363\\
BlDTr & Broadleaf Deciduous Tropical & 286\\
BlDTe & Broadleaf Deciduous Temperate & 345\\
BlDBo & Broadleaf Deciduous Boreal & 62\\
\addlinespace
NlETe & Needleleaf Evergreen Temperate & 130\\
NlEBo & Needleleaf Evergreen Boreal & 30\\
NlD & Needleleaf Deciduous & 19\\
ShE & Shrub Evergreen & 1120\\
ShDTe & Shrub Deciduous Temperate & 330\\
\addlinespace
ShDBo & Shrub Deciduous Boreal & 94\\
C3GAr & C3 Grass Arctic & 157\\
C3GTe & C3 Grass Temperate & 624\\
C4G & C4 Grass & 255\\
\bottomrule
\end{tabular}
\end{table}
#+END_EXPORT

